<a href="https://colab.research.google.com/github/Iveynganga/PYTHON-DATA-ANALYSIS/blob/main/SQLexample.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
-- create a database

create database School;
use School;

-- creating a table

create table Students(
Student_Id int primary key,
LastName varchar(255) not null,
FirstName varchar (255) not null,
Age int);

-- Test out the constraints
-- not null
insert into Students(Student_Id,LastName,FirstName,Age) values
(1,'Doe',Null,25);

select * from Students;

-- add a column to our table
-- with the constraint unique

-- add a column to our table
-- with the constraint unique
alter table Students
add column Subject varchar(255) unique;

insert into Students(Student_Id,LastName,FirstName,Age,Subject) values
(2,'Jane', 'Doe',31,'Math'),
(3,'Mike', 'Kevin',26,'Literature'),
(4, 'Joy','Ivy',27,'Math');

-- drop column subject
alter table Students
drop column Subject;


CREATE TABLE Persons (
ID INT PRIMARY KEY,
LastName VARCHAR(255),
FirstName VARCHAR(255),
Age INT,
Subject VARCHAR(255)
);
INSERT INTO Persons (ID, LastName, FirstName, Age, Subject) VALUES
(1, 'Smith', 'John', 30, 'Math'),
(2, 'Johnson', 'Emily', 25, 'English'),
(3, 'Williams', 'Michael', 35, 'Science'),
(4, 'Brown', 'Jessica', 28, 'History'),
(5, 'Jones', 'David', 32, 'Geography'),
(6, 'Davis', 'Sarah', 30, 'Biology'),
(7, 'Wilson', 'James', 31, 'Physics'),
(8, 'Martinez', 'Ashley', 27, 'Chemistry'),
(9, 'Anderson', 'Christopher', 33, 'Art'),
(10, 'Taylor', 'Amanda', 25, 'Music'),
(11, 'Thomas', 'Matthew', 34, 'Literature'),
(12, 'Jackson', 'Stephanie', 28, 'Computer Science'),
(13, 'White', 'Daniel', 28, 'Economics'),
(14, 'Harris', 'Rachel', 32, 'Psychology'),
(15, 'Clark', 'Justin', 25, 'Sociology'),
(16, 'Lewis', 'Melissa', 35, 'Anthropology'),
(17, 'Lee', 'Andrew', 29, 'Political Science'),
(18, 'Walker', 'Laura', 31, 'Philosophy'),
(19, 'Wright', 'Brian', 27, 'Languages'),
(20, 'Young', 'Nicole', 33, 'Engineering');